{
  "services": [
    {
      "id": "webDev",
      "name": "Web Development",
      "description": "Builds responsive, SEO-friendly websites tailored to your business needs.",
      "packages": [
        {
          "id": "starter",
          "name": "Starter",
          "price": "NRs 35,000",
          "features": "Includes up to 5 pages, SEO, and 3 months of support.",
          "fullDescription": "Our Starter package is perfect for small businesses and startups. It includes a fully responsive design with up to 5 custom-designed pages, basic on-page SEO to improve search engine visibility, and 3 months of dedicated technical support."
        },
        {
          "id": "standard",
          "name": "Standard",
          "price": "NRs 60,000",
          "features": "Includes up to 10 pages, SEO, and 6 months of support.",
          "fullDescription": "The Standard package is designed for growing businesses. It includes everything in the Starter package, expanded to 10 pages, with advanced SEO features, and 6 months of comprehensive support to ensure your website runs smoothly."
        },
        {
          "id": "premium",
          "name": "Premium",
          "price": "NRs 85,000",
          "features": "Includes up to 25 pages, SEO, and 1 year of support.",
          "fullDescription": "Our Premium package offers a complete solution for established businesses. It includes up to 25 pages, advanced SEO, e-commerce functionality, and a full year of priority support, ensuring your online presence is robust and scalable."
        },
        {
          "id": "static-website",
          "name": "Static Website Design",
          "price": "NRs 18,000",
          "features": "5-Page Static Website, Responsive Design, Fast & Secure.",
          "fullDescription": "Tailored to meet your vision with a custom design approach. Includes a 5-page static website optimized for all devices, ensuring speed and reliability. Estimated duration: 1-2 weeks."
        },
        {
          "id": "custom-web",
          "name": "Custom Project",
          "price": "NRs 1,200 - 1,800 / Hour",
          "features": "Tailored solution based on complexity and duration.",
          "fullDescription": "A fully customized web development solution tailored to your specific requirements. Pricing is based on the complexity of the task and the estimated hours required, ranging from NRs 1,200 to 1,800 per hour."
        }
      ]
    },
    {
      "id": "digitalMarketing",
      "name": "Digital Marketing",
      "description": "Boosts your online presence with strategic content, ad campaigns, and social media engagement.",
      "packages": [
        {
          "id": "seo-basic",
          "name": "SEO - Basic Package",
          "price": "NRs 15,000/mo",
          "features": "Keyword Research, On-Page Optimization, Monthly Report.",
          "fullDescription": "Includes in-depth keyword research, on-page optimization (meta titles, descriptions, headers), and a detailed monthly SEO performance report. Initial Setup Fee: NRs 5,000. Minimum duration: 3 months."
        },
        {
          "id": "seo-advanced",
          "name": "SEO - Advanced Package",
          "price": "NRs 30,000/mo",
          "features": "Includes Basic + Competitor Analysis, Link Building, Google Analytics.",
          "fullDescription": "Everything in the Basic Package plus in-depth competitor analysis, off-page SEO (link building), and Google Analytics setup. Initial Setup Fee: NRs 5,000. Minimum duration: 6 months."
        },
        {
          "id": "social-gt1",
          "name": "Social Media - GT 1",
          "price": "NRs 35,000",
          "features": "3 Posts, $45 Ad Credit, Page Management.",
          "fullDescription": "Includes page management, 3 posts (concept + creation + posting), design adaptation, digital audience identification, and campaign consultation. Includes $45 ad credit."
        },
        {
          "id": "social-gt2",
          "name": "Social Media - GT 2",
          "price": "NRs 60,000",
          "features": "6 Posts, $78 Ad Credit, Page Management.",
          "fullDescription": "Includes page management, 6 posts (concept + creation + posting), design adaptation, digital audience identification, and campaign consultation. Includes $78 ad credit."
        },
        {
          "id": "social-gt3",
          "name": "Social Media - GT 3",
          "price": "NRs 120,000",
          "features": "15 Posts, $156 Ad Credit, Page Management.",
          "fullDescription": "Includes page management, 15 posts (concept + creation + posting), design adaptation, digital audience identification, and campaign consultation. Includes $156 ad credit."
        },
        {
          "id": "social-gt4",
          "name": "Social Media - GT 4",
          "price": "NRs 50,000",
          "features": "Client Managed Credit (up to $200), 15 Posts, Page Management.",
          "fullDescription": "Includes page management, 15 posts (concept + creation + posting), design adaptation, digital audience identification, and campaign consultation. Client manages ad credit (up to $200)."
        },
        {
          "id": "google-ads",
          "name": "Google Ads",
          "price": "NRs 50,000/mo",
          "features": "70k-100k Impressions, 2 Campaigns, $100 Credit.",
          "fullDescription": "Includes campaign management (ad creation, audience identification, deployment, reporting) for 2 campaigns. Expected impressions: 70,000 - 100,000. Includes $100 ad credit."
        },
        {
          "id": "google-ads-mgmt",
          "name": "Google Ads - Management Only",
          "price": "NRs 30,000/mo",
          "features": "Campaign Management Only. Excludes Ad Credit.",
          "fullDescription": "Professional management of your Google Ads campaigns. Includes ad creation, audience identification, ad deployment, and reporting. Ad credit is not included and must be funded directly by the client."
        },
        {
          "id": "tiktok-basic",
          "name": "TikTok - Basic",
          "price": "NRs 30,000",
          "features": "4 Videos, Scripting, Shooting, Editing.",
          "fullDescription": "Creation of 4 engaging TikTok videos (up to 30s). Includes video scripting, concept development, shooting, editing, and basic sound integration. Duration: 2-4 weeks."
        },
        {
          "id": "tiktok-standard",
          "name": "TikTok - Standard",
          "price": "NRs 40,000",
          "features": "8 Videos, Enhanced Editing.",
          "fullDescription": "Creation of 8 creative TikTok videos (up to 30s). Includes video scripting, concept development, shooting, and enhanced editing with captivating captions. Duration: 4-6 weeks."
        },
        {
          "id": "tiktok-premium",
          "name": "TikTok - Premium",
          "price": "NRs 70,000",
          "features": "16 Videos, Advanced Scripting & Editing.",
          "fullDescription": "Creation of 16 high-quality TikTok videos (up to 60s). Includes advanced scripting, professional shooting, premium editing, and engaging subtitles. Duration: 6-8 weeks."
        },
        {
          "id": "custom-digital",
          "name": "Custom Project",
          "price": "NRs 1,200 - 1,800 / Hour",
          "features": "Tailored digital marketing strategy based on complexity.",
          "fullDescription": "A fully customized digital marketing strategy tailored to your specific goals. Pricing is based on the complexity of the campaign and the estimated hours required, ranging from NRs 1,200 to 1,800 per hour."
        }
      ]
    },
    {
      "id": "webHosting",
      "name": "Web Hosting",
      "description": "Reliable and secure hosting solutions with ample storage, bandwidth, and email accounts.",
      "packages": [
        {
          "id": "basic",
          "name": "Basic",
          "price": "NRs 5,000/Year",
          "features": "1GB Disk Space, Unlimited Bandwidth, and 1 Email Account.",
          "fullDescription": "Our Basic hosting plan is perfect for personal websites and small projects. It includes 1GB of disk space, unmetered bandwidth, and one professional email account, providing a reliable and affordable hosting solution."
        },
        {
          "id": "professional",
          "name": "Professional",
          "price": "NRs 8,000/Year",
          "features": "5GB Disk Space, Unlimited Bandwidth, and 5 Email Accounts.",
          "fullDescription": "The Professional hosting plan is ideal for small businesses and freelancers. It offers 5GB of disk space, unmetered bandwidth, and 5 professional email accounts, giving you more room to grow."
        },
        {
          "id": "business",
          "name": "Business",
          "price": "NRs 18,000/Year",
          "features": "25GB Disk Space, Unlimited Bandwidth, and 15 Email Accounts.",
          "fullDescription": "Our Business hosting plan is designed for high-traffic websites and e-commerce stores. It comes with 25GB of disk space, unmetered bandwidth, and 15 professional email accounts, ensuring top performance and reliability."
        }
      ]
    },
    {
      "id": "graphicDesign",
      "name": "Graphic Design",
      "description": "Creates visual identities, marketing materials, and illustrations.",
      "packages": [
        {
          "id": "logo",
          "name": "Logo",
          "price": "NRs 8,000",
          "features": "3 concepts, 2 revisions, print-ready files.",
          "fullDescription": "Professional logo design with multiple concepts and revisions, delivered in vector and raster formats suitable for web and print."
        },
        {
          "id": "branding",
          "name": "Branding",
          "price": "NRs 30,000",
          "features": "Logo, color palette, typography, brand guidelines.",
          "fullDescription": "Comprehensive branding package including logo design, color system, typography, and a concise brand guideline to ensure consistent identity across channels."
        },
        {
          "id": "marketing",
          "name": "Marketing Collateral",
          "price": "NRs 15,000",
          "features": "Brochure, social templates, business card design.",
          "fullDescription": "Design of essential marketing collateral such as brochures, social media templates, and business cards to promote your brand effectively."
        }
      ]
    },
    {
      "id": "mobileApp",
      "name": "Mobile App Development",
      "description": "Designs and builds native and cross-platform mobile applications.",
      "packages": [
        {
          "id": "prototype",
          "name": "Prototype",
          "price": "NRs 45,000",
          "features": "Clickable prototype, basic UX design.",
          "fullDescription": "An interactive prototype to validate app concepts and user flows, ideal for pitching or early testing."
        },
        {
          "id": "standard",
          "name": "Standard App",
          "price": "NRs 150,000",
          "features": "Up to 10 screens, API integration, 3 months support.",
          "fullDescription": "Complete mobile app development for small to medium projects, including design, development, API integration and initial support."
        },
        {
          "id": "enterprise",
          "name": "Enterprise App",
          "price": "NRs 400,000",
          "features": "Custom features, admin panel, 1 year support.",
          "fullDescription": "End-to-end enterprise-grade mobile application with custom features, scalability, admin dashboard and long-term support."
        }
      ]
    }
  ]
}