
{
  "services": [
    {
      "id": "webDev",
      "name": "Web Development",
      "description": "Builds responsive, SEO-friendly websites tailored to your business needs.",
      "packages": [
        {
          "id": "starter",
          "name": "Starter",
          "price": "NRs 35,000",
          "features": "Includes up to 5 pages, SEO, and 3 months of support.",
          "fullDescription": "Our Starter package is perfect for small businesses and startups. It includes a fully responsive design with up to 5 custom-designed pages, basic on-page SEO to improve search engine visibility, and 3 months of dedicated technical support."
        },
        {
          "id": "standard",
          "name": "Standard",
          "price": "NRs 60,000",
          "features": "Includes up to 10 pages, SEO, and 6 months of support.",
          "fullDescription": "The Standard package is designed for growing businesses. It includes everything in the Starter package, expanded to 10 pages, with advanced SEO features, and 6 months of comprehensive support to ensure your website runs smoothly."
        },
        {
          "id": "premium",
          "name": "Premium",
          "price": "NRs 85,000",
          "features": "Includes up to 25 pages, SEO, and 1 year of support.",
          "fullDescription": "Our Premium package offers a complete solution for established businesses. It includes up to 25 pages, advanced SEO, e-commerce functionality, and a full year of priority support, ensuring your online presence is robust and scalable."
        }
      ]
    },
    {
      "id": "digitalMarketing",
      "name": "Digital Marketing",
      "description": "Boosts your online presence with strategic content, ad campaigns, and social media engagement.",
      "packages": [
        {
          "id": "gt1",
          "name": "GT 1",
          "price": "NRs 30,000",
          "features": "Includes 4 creative designs, USD $53 credit, and reach up to 80K+.",
          "fullDescription": "The GT 1 package is ideal for businesses starting with digital marketing. It includes 4 creative designs for social media, a USD $53 advertising credit to kickstart your campaigns, and an estimated reach of over 80,000 potential customers."
        },
        {
          "id": "gt2",
          "name": "GT 2",
          "price": "NRs 50,000",
          "features": "Includes 8 creative designs, USD $88 credit, and reach up to 133K+.",
          "fullDescription": "The GT 2 package is designed for businesses looking to expand their digital footprint. It includes 8 creative designs, a USD $88 advertising credit, and an estimated reach of over 133,000, helping you connect with a larger audience."
        },
        {
          "id": "gt3",
          "name": "GT 3",
          "price": "NRs 75,000",
          "features": "Includes 18 creative designs, USD $176 credit, and reach up to 266K+.",
          "fullDescription": "Our GT 3 package is tailored for aggressive growth. It includes 18 creative designs, a generous USD $176 advertising credit, and an impressive reach of over 266,000, maximizing your market penetration."
        },
        {
          "id": "gt4",
          "name": "GT 4",
          "price": "NRs 100,000",
          "features": "Includes 20 creative designs, no credit, and a custom reach.",
          "fullDescription": "The GT 4 package offers a fully customized digital marketing strategy. It includes 20 creative designs and a tailored reach based on your specific business goals, without a fixed advertising credit, providing maximum flexibility."
        }
      ]
    },
    {
      "id": "webHosting",
      "name": "Web Hosting",
      "description": "Reliable and secure hosting solutions with ample storage, bandwidth, and email accounts.",
      "packages": [
        {
          "id": "basic",
          "name": "Basic",
          "price": "NRs 5,000/Year",
          "features": "1GB Disk Space, Unlimited Bandwidth, and 1 Email Account.",
          "fullDescription": "Our Basic hosting plan is perfect for personal websites and small projects. It includes 1GB of disk space, unmetered bandwidth, and one professional email account, providing a reliable and affordable hosting solution."
        },
        {
          "id": "professional",
          "name": "Professional",
          "price": "NRs 8,000/Year",
          "features": "5GB Disk Space, Unlimited Bandwidth, and 5 Email Accounts.",
          "fullDescription": "The Professional hosting plan is ideal for small businesses and freelancers. It offers 5GB of disk space, unmetered bandwidth, and 5 professional email accounts, giving you more room to grow."
        },
        {
          "id": "business",
          "name": "Business",
          "price": "NRs 18,000/Year",
          "features": "25GB Disk Space, Unlimited Bandwidth, and 15 Email Accounts.",
          "fullDescription": "Our Business hosting plan is designed for high-traffic websites and e-commerce stores. It comes with 25GB of disk space, unmetered bandwidth, and 15 professional email accounts, ensuring top performance and reliability."
        }
      ]
    }
  ]
}
